Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxDma_bf.h
/** \brief Length for Ifx_DMA_ME_SR_Bits.RS */
#define IFX_DMA_ME_SR_RS_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_SR_Bits.RS */
#define IFX_DMA_ME_SR_RS_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_SR_Bits.RS */
#define IFX_DMA_ME_SR_RS_OFF (0u)

/** \brief Length for Ifx_DMA_ME_SR_Bits.WS */
#define IFX_DMA_ME_SR_WS_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_SR_Bits.WS */
#define IFX_DMA_ME_SR_WS_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_SR_Bits.WS */
#define IFX_DMA_ME_SR_WS_OFF (4u)

/** \brief Length for Ifx_DMA_ME_SR_Bits.CH */
#define IFX_DMA_ME_SR_CH_LEN (7u)

/** \brief Mask for Ifx_DMA_ME_SR_Bits.CH */
#define IFX_DMA_ME_SR_CH_MSK (0x7fu)

/** \brief Offset for Ifx_DMA_ME_SR_Bits.CH */
#define IFX_DMA_ME_SR_CH_OFF (16u)

/** \brief Length for Ifx_DMA_ME_R0_Bits.RD00 */
#define IFX_DMA_ME_R0_RD00_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R0_Bits.RD00 */
#define IFX_DMA_ME_R0_RD00_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R0_Bits.RD00 */
#define IFX_DMA_ME_R0_RD00_OFF (0u)

/** \brief Length for Ifx_DMA_ME_R0_Bits.RD01 */
#define IFX_DMA_ME_R0_RD01_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R0_Bits.RD01 */
#define IFX_DMA_ME_R0_RD01_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R0_Bits.RD01 */
#define IFX_DMA_ME_R0_RD01_OFF (8u)

/** \brief Length for Ifx_DMA_ME_R0_Bits.RD02 */
#define IFX_DMA_ME_R0_RD02_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R0_Bits.RD02 */
#define IFX_DMA_ME_R0_RD02_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R0_Bits.RD02 */
#define IFX_DMA_ME_R0_RD02_OFF (16u)

/** \brief Length for Ifx_DMA_ME_R0_Bits.RD03 */
#define IFX_DMA_ME_R0_RD03_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R0_Bits.RD03 */
#define IFX_DMA_ME_R0_RD03_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R0_Bits.RD03 */
#define IFX_DMA_ME_R0_RD03_OFF (24u)

/** \brief Length for Ifx_DMA_ME_R1_Bits.RD10 */
#define IFX_DMA_ME_R1_RD10_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R1_Bits.RD10 */
#define IFX_DMA_ME_R1_RD10_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R1_Bits.RD10 */
#define IFX_DMA_ME_R1_RD10_OFF (0u)

/** \brief Length for Ifx_DMA_ME_R1_Bits.RD11 */
#define IFX_DMA_ME_R1_RD11_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R1_Bits.RD11 */
#define IFX_DMA_ME_R1_RD11_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R1_Bits.RD11 */
#define IFX_DMA_ME_R1_RD11_OFF (8u)

/** \brief Length for Ifx_DMA_ME_R1_Bits.RD12 */
#define IFX_DMA_ME_R1_RD12_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R1_Bits.RD12 */
#define IFX_DMA_ME_R1_RD12_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R1_Bits.RD12 */
#define IFX_DMA_ME_R1_RD12_OFF (16u)

/** \brief Length for Ifx_DMA_ME_R1_Bits.RD13 */
#define IFX_DMA_ME_R1_RD13_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R1_Bits.RD13 */
#define IFX_DMA_ME_R1_RD13_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R1_Bits.RD13 */
#define IFX_DMA_ME_R1_RD13_OFF (24u)

/** \brief Length for Ifx_DMA_ME_R2_Bits.RD20 */
#define IFX_DMA_ME_R2_RD20_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R2_Bits.RD20 */
#define IFX_DMA_ME_R2_RD20_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R2_Bits.RD20 */
#define IFX_DMA_ME_R2_RD20_OFF (0u)

/** \brief Length for Ifx_DMA_ME_R2_Bits.RD21 */
#define IFX_DMA_ME_R2_RD21_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R2_Bits.RD21 */
#define IFX_DMA_ME_R2_RD21_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R2_Bits.RD21 */
#define IFX_DMA_ME_R2_RD21_OFF (8u)

/** \brief Length for Ifx_DMA_ME_R2_Bits.RD22 */
#define IFX_DMA_ME_R2_RD22_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R2_Bits.RD22 */
#define IFX_DMA_ME_R2_RD22_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R2_Bits.RD22 */
#define IFX_DMA_ME_R2_RD22_OFF (16u)

/** \brief Length for Ifx_DMA_ME_R2_Bits.RD23 */
#define IFX_DMA_ME_R2_RD23_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R2_Bits.RD23 */
#define IFX_DMA_ME_R2_RD23_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R2_Bits.RD23 */
#define IFX_DMA_ME_R2_RD23_OFF (24u)

/** \brief Length for Ifx_DMA_ME_R3_Bits.RD30 */
#define IFX_DMA_ME_R3_RD30_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R3_Bits.RD30 */
#define IFX_DMA_ME_R3_RD30_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R3_Bits.RD30 */
#define IFX_DMA_ME_R3_RD30_OFF (0u)

/** \brief Length for Ifx_DMA_ME_R3_Bits.RD31 */
#define IFX_DMA_ME_R3_RD31_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R3_Bits.RD31 */
#define IFX_DMA_ME_R3_RD31_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R3_Bits.RD31 */
#define IFX_DMA_ME_R3_RD31_OFF (8u)

/** \brief Length for Ifx_DMA_ME_R3_Bits.RD32 */
#define IFX_DMA_ME_R3_RD32_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R3_Bits.RD32 */
#define IFX_DMA_ME_R3_RD32_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R3_Bits.RD32 */
#define IFX_DMA_ME_R3_RD32_OFF (16u)

/** \brief Length for Ifx_DMA_ME_R3_Bits.RD33 */
#define IFX_DMA_ME_R3_RD33_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R3_Bits.RD33 */
#define IFX_DMA_ME_R3_RD33_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R3_Bits.RD33 */
#define IFX_DMA_ME_R3_RD33_OFF (24u)

/** \brief Length for Ifx_DMA_ME_R4_Bits.RD40 */
#define IFX_DMA_ME_R4_RD40_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R4_Bits.RD40 */
#define IFX_DMA_ME_R4_RD40_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R4_Bits.RD40 */
#define IFX_DMA_ME_R4_RD40_OFF (0u)

/** \brief Length for Ifx_DMA_ME_R4_Bits.RD41 */
#define IFX_DMA_ME_R4_RD41_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R4_Bits.RD41 */
#define IFX_DMA_ME_R4_RD41_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R4_Bits.RD41 */
#define IFX_DMA_ME_R4_RD41_OFF (8u)

/** \brief Length for Ifx_DMA_ME_R4_Bits.RD42 */
#define IFX_DMA_ME_R4_RD42_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R4_Bits.RD42 */
#define IFX_DMA_ME_R4_RD42_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R4_Bits.RD42 */
#define IFX_DMA_ME_R4_RD42_OFF (16u)

/** \brief Length for Ifx_DMA_ME_R4_Bits.RD43 */
#define IFX_DMA_ME_R4_RD43_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R4_Bits.RD43 */
#define IFX_DMA_ME_R4_RD43_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R4_Bits.RD43 */
#define IFX_DMA_ME_R4_RD43_OFF (24u)

/** \brief Length for Ifx_DMA_ME_R5_Bits.RD50 */
#define IFX_DMA_ME_R5_RD50_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R5_Bits.RD50 */
#define IFX_DMA_ME_R5_RD50_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R5_Bits.RD50 */
#define IFX_DMA_ME_R5_RD50_OFF (0u)

/** \brief Length for Ifx_DMA_ME_R5_Bits.RD51 */
#define IFX_DMA_ME_R5_RD51_LEN (8u)

