Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxDma_bf.h
/** \brief Mask for Ifx_DMA_ME_R5_Bits.RD51 */
#define IFX_DMA_ME_R5_RD51_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R5_Bits.RD51 */
#define IFX_DMA_ME_R5_RD51_OFF (8u)

/** \brief Length for Ifx_DMA_ME_R5_Bits.RD52 */
#define IFX_DMA_ME_R5_RD52_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R5_Bits.RD52 */
#define IFX_DMA_ME_R5_RD52_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R5_Bits.RD52 */
#define IFX_DMA_ME_R5_RD52_OFF (16u)

/** \brief Length for Ifx_DMA_ME_R5_Bits.RD53 */
#define IFX_DMA_ME_R5_RD53_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R5_Bits.RD53 */
#define IFX_DMA_ME_R5_RD53_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R5_Bits.RD53 */
#define IFX_DMA_ME_R5_RD53_OFF (24u)

/** \brief Length for Ifx_DMA_ME_R6_Bits.RD60 */
#define IFX_DMA_ME_R6_RD60_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R6_Bits.RD60 */
#define IFX_DMA_ME_R6_RD60_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R6_Bits.RD60 */
#define IFX_DMA_ME_R6_RD60_OFF (0u)

/** \brief Length for Ifx_DMA_ME_R6_Bits.RD61 */
#define IFX_DMA_ME_R6_RD61_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R6_Bits.RD61 */
#define IFX_DMA_ME_R6_RD61_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R6_Bits.RD61 */
#define IFX_DMA_ME_R6_RD61_OFF (8u)

/** \brief Length for Ifx_DMA_ME_R6_Bits.RD62 */
#define IFX_DMA_ME_R6_RD62_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R6_Bits.RD62 */
#define IFX_DMA_ME_R6_RD62_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R6_Bits.RD62 */
#define IFX_DMA_ME_R6_RD62_OFF (16u)

/** \brief Length for Ifx_DMA_ME_R6_Bits.RD63 */
#define IFX_DMA_ME_R6_RD63_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R6_Bits.RD63 */
#define IFX_DMA_ME_R6_RD63_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R6_Bits.RD63 */
#define IFX_DMA_ME_R6_RD63_OFF (24u)

/** \brief Length for Ifx_DMA_ME_R7_Bits.RD70 */
#define IFX_DMA_ME_R7_RD70_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R7_Bits.RD70 */
#define IFX_DMA_ME_R7_RD70_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R7_Bits.RD70 */
#define IFX_DMA_ME_R7_RD70_OFF (0u)

/** \brief Length for Ifx_DMA_ME_R7_Bits.RD71 */
#define IFX_DMA_ME_R7_RD71_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R7_Bits.RD71 */
#define IFX_DMA_ME_R7_RD71_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R7_Bits.RD71 */
#define IFX_DMA_ME_R7_RD71_OFF (8u)

/** \brief Length for Ifx_DMA_ME_R7_Bits.RD72 */
#define IFX_DMA_ME_R7_RD72_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R7_Bits.RD72 */
#define IFX_DMA_ME_R7_RD72_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R7_Bits.RD72 */
#define IFX_DMA_ME_R7_RD72_OFF (16u)

/** \brief Length for Ifx_DMA_ME_R7_Bits.RD73 */
#define IFX_DMA_ME_R7_RD73_LEN (8u)

/** \brief Mask for Ifx_DMA_ME_R7_Bits.RD73 */
#define IFX_DMA_ME_R7_RD73_MSK (0xffu)

/** \brief Offset for Ifx_DMA_ME_R7_Bits.RD73 */
#define IFX_DMA_ME_R7_RD73_OFF (24u)

/** \brief Length for Ifx_DMA_ME_RDCRC_Bits.RDCRC */
#define IFX_DMA_ME_RDCRC_RDCRC_LEN (32u)

/** \brief Mask for Ifx_DMA_ME_RDCRC_Bits.RDCRC */
#define IFX_DMA_ME_RDCRC_RDCRC_MSK (0xffffffffu)

/** \brief Offset for Ifx_DMA_ME_RDCRC_Bits.RDCRC */
#define IFX_DMA_ME_RDCRC_RDCRC_OFF (0u)

/** \brief Length for Ifx_DMA_ME_SDCRC_Bits.SDCRC */
#define IFX_DMA_ME_SDCRC_SDCRC_LEN (32u)

/** \brief Mask for Ifx_DMA_ME_SDCRC_Bits.SDCRC */
#define IFX_DMA_ME_SDCRC_SDCRC_MSK (0xffffffffu)

/** \brief Offset for Ifx_DMA_ME_SDCRC_Bits.SDCRC */
#define IFX_DMA_ME_SDCRC_SDCRC_OFF (0u)

/** \brief Length for Ifx_DMA_ME_SADR_Bits.SADR */
#define IFX_DMA_ME_SADR_SADR_LEN (32u)

/** \brief Mask for Ifx_DMA_ME_SADR_Bits.SADR */
#define IFX_DMA_ME_SADR_SADR_MSK (0xffffffffu)

/** \brief Offset for Ifx_DMA_ME_SADR_Bits.SADR */
#define IFX_DMA_ME_SADR_SADR_OFF (0u)

/** \brief Length for Ifx_DMA_ME_DADR_Bits.DADR */
#define IFX_DMA_ME_DADR_DADR_LEN (32u)

/** \brief Mask for Ifx_DMA_ME_DADR_Bits.DADR */
#define IFX_DMA_ME_DADR_DADR_MSK (0xffffffffu)

/** \brief Offset for Ifx_DMA_ME_DADR_Bits.DADR */
#define IFX_DMA_ME_DADR_DADR_OFF (0u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.SMF */
#define IFX_DMA_ME_ADICR_SMF_LEN (3u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.SMF */
#define IFX_DMA_ME_ADICR_SMF_MSK (0x7u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.SMF */
#define IFX_DMA_ME_ADICR_SMF_OFF (0u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.INCS */
#define IFX_DMA_ME_ADICR_INCS_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.INCS */
#define IFX_DMA_ME_ADICR_INCS_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.INCS */
#define IFX_DMA_ME_ADICR_INCS_OFF (3u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.DMF */
#define IFX_DMA_ME_ADICR_DMF_LEN (3u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.DMF */
#define IFX_DMA_ME_ADICR_DMF_MSK (0x7u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.DMF */
#define IFX_DMA_ME_ADICR_DMF_OFF (4u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.INCD */
#define IFX_DMA_ME_ADICR_INCD_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.INCD */
#define IFX_DMA_ME_ADICR_INCD_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.INCD */
#define IFX_DMA_ME_ADICR_INCD_OFF (7u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.CBLS */
#define IFX_DMA_ME_ADICR_CBLS_LEN (4u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.CBLS */
#define IFX_DMA_ME_ADICR_CBLS_MSK (0xfu)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.CBLS */
#define IFX_DMA_ME_ADICR_CBLS_OFF (8u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.CBLD */
#define IFX_DMA_ME_ADICR_CBLD_LEN (4u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.CBLD */
#define IFX_DMA_ME_ADICR_CBLD_MSK (0xfu)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.CBLD */
#define IFX_DMA_ME_ADICR_CBLD_OFF (12u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.SHCT */
#define IFX_DMA_ME_ADICR_SHCT_LEN (4u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.SHCT */
#define IFX_DMA_ME_ADICR_SHCT_MSK (0xfu)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.SHCT */
#define IFX_DMA_ME_ADICR_SHCT_OFF (16u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.SCBE */
#define IFX_DMA_ME_ADICR_SCBE_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.SCBE */
#define IFX_DMA_ME_ADICR_SCBE_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.SCBE */
#define IFX_DMA_ME_ADICR_SCBE_OFF (20u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.DCBE */
#define IFX_DMA_ME_ADICR_DCBE_LEN (1u)

