Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxDma_bf.h
/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.DCBE */
#define IFX_DMA_ME_ADICR_DCBE_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.DCBE */
#define IFX_DMA_ME_ADICR_DCBE_OFF (21u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.STAMP */
#define IFX_DMA_ME_ADICR_STAMP_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.STAMP */
#define IFX_DMA_ME_ADICR_STAMP_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.STAMP */
#define IFX_DMA_ME_ADICR_STAMP_OFF (22u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.WRPSE */
#define IFX_DMA_ME_ADICR_WRPSE_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.WRPSE */
#define IFX_DMA_ME_ADICR_WRPSE_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.WRPSE */
#define IFX_DMA_ME_ADICR_WRPSE_OFF (24u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.WRPDE */
#define IFX_DMA_ME_ADICR_WRPDE_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.WRPDE */
#define IFX_DMA_ME_ADICR_WRPDE_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.WRPDE */
#define IFX_DMA_ME_ADICR_WRPDE_OFF (25u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.INTCT */
#define IFX_DMA_ME_ADICR_INTCT_LEN (2u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.INTCT */
#define IFX_DMA_ME_ADICR_INTCT_MSK (0x3u)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.INTCT */
#define IFX_DMA_ME_ADICR_INTCT_OFF (26u)

/** \brief Length for Ifx_DMA_ME_ADICR_Bits.IRDV */
#define IFX_DMA_ME_ADICR_IRDV_LEN (4u)

/** \brief Mask for Ifx_DMA_ME_ADICR_Bits.IRDV */
#define IFX_DMA_ME_ADICR_IRDV_MSK (0xfu)

/** \brief Offset for Ifx_DMA_ME_ADICR_Bits.IRDV */
#define IFX_DMA_ME_ADICR_IRDV_OFF (28u)

/** \brief Length for Ifx_DMA_ME_CHCR_Bits.TREL */
#define IFX_DMA_ME_CHCR_TREL_LEN (14u)

/** \brief Mask for Ifx_DMA_ME_CHCR_Bits.TREL */
#define IFX_DMA_ME_CHCR_TREL_MSK (0x3fffu)

/** \brief Offset for Ifx_DMA_ME_CHCR_Bits.TREL */
#define IFX_DMA_ME_CHCR_TREL_OFF (0u)

/** \brief Length for Ifx_DMA_ME_CHCR_Bits.BLKM */
#define IFX_DMA_ME_CHCR_BLKM_LEN (3u)

/** \brief Mask for Ifx_DMA_ME_CHCR_Bits.BLKM */
#define IFX_DMA_ME_CHCR_BLKM_MSK (0x7u)

/** \brief Offset for Ifx_DMA_ME_CHCR_Bits.BLKM */
#define IFX_DMA_ME_CHCR_BLKM_OFF (16u)

/** \brief Length for Ifx_DMA_ME_CHCR_Bits.RROAT */
#define IFX_DMA_ME_CHCR_RROAT_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHCR_Bits.RROAT */
#define IFX_DMA_ME_CHCR_RROAT_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHCR_Bits.RROAT */
#define IFX_DMA_ME_CHCR_RROAT_OFF (19u)

/** \brief Length for Ifx_DMA_ME_CHCR_Bits.CHMODE */
#define IFX_DMA_ME_CHCR_CHMODE_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHCR_Bits.CHMODE */
#define IFX_DMA_ME_CHCR_CHMODE_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHCR_Bits.CHMODE */
#define IFX_DMA_ME_CHCR_CHMODE_OFF (20u)

/** \brief Length for Ifx_DMA_ME_CHCR_Bits.CHDW */
#define IFX_DMA_ME_CHCR_CHDW_LEN (3u)

/** \brief Mask for Ifx_DMA_ME_CHCR_Bits.CHDW */
#define IFX_DMA_ME_CHCR_CHDW_MSK (0x7u)

/** \brief Offset for Ifx_DMA_ME_CHCR_Bits.CHDW */
#define IFX_DMA_ME_CHCR_CHDW_OFF (21u)

/** \brief Length for Ifx_DMA_ME_CHCR_Bits.PATSEL */
#define IFX_DMA_ME_CHCR_PATSEL_LEN (3u)

/** \brief Mask for Ifx_DMA_ME_CHCR_Bits.PATSEL */
#define IFX_DMA_ME_CHCR_PATSEL_MSK (0x7u)

/** \brief Offset for Ifx_DMA_ME_CHCR_Bits.PATSEL */
#define IFX_DMA_ME_CHCR_PATSEL_OFF (24u)

/** \brief Length for Ifx_DMA_ME_CHCR_Bits.SWAP */
#define IFX_DMA_ME_CHCR_SWAP_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHCR_Bits.SWAP */
#define IFX_DMA_ME_CHCR_SWAP_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHCR_Bits.SWAP */
#define IFX_DMA_ME_CHCR_SWAP_OFF (27u)

/** \brief Length for Ifx_DMA_ME_CHCR_Bits.PRSEL */
#define IFX_DMA_ME_CHCR_PRSEL_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHCR_Bits.PRSEL */
#define IFX_DMA_ME_CHCR_PRSEL_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHCR_Bits.PRSEL */
#define IFX_DMA_ME_CHCR_PRSEL_OFF (28u)

/** \brief Length for Ifx_DMA_ME_SHADR_Bits.SHADR */
#define IFX_DMA_ME_SHADR_SHADR_LEN (32u)

/** \brief Mask for Ifx_DMA_ME_SHADR_Bits.SHADR */
#define IFX_DMA_ME_SHADR_SHADR_MSK (0xffffffffu)

/** \brief Offset for Ifx_DMA_ME_SHADR_Bits.SHADR */
#define IFX_DMA_ME_SHADR_SHADR_OFF (0u)

/** \brief Length for Ifx_DMA_ME_CHSR_Bits.TCOUNT */
#define IFX_DMA_ME_CHSR_TCOUNT_LEN (14u)

/** \brief Mask for Ifx_DMA_ME_CHSR_Bits.TCOUNT */
#define IFX_DMA_ME_CHSR_TCOUNT_MSK (0x3fffu)

/** \brief Offset for Ifx_DMA_ME_CHSR_Bits.TCOUNT */
#define IFX_DMA_ME_CHSR_TCOUNT_OFF (0u)

/** \brief Length for Ifx_DMA_ME_CHSR_Bits.LXO */
#define IFX_DMA_ME_CHSR_LXO_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHSR_Bits.LXO */
#define IFX_DMA_ME_CHSR_LXO_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHSR_Bits.LXO */
#define IFX_DMA_ME_CHSR_LXO_OFF (15u)

/** \brief Length for Ifx_DMA_ME_CHSR_Bits.WRPS */
#define IFX_DMA_ME_CHSR_WRPS_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHSR_Bits.WRPS */
#define IFX_DMA_ME_CHSR_WRPS_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHSR_Bits.WRPS */
#define IFX_DMA_ME_CHSR_WRPS_OFF (16u)

/** \brief Length for Ifx_DMA_ME_CHSR_Bits.WRPD */
#define IFX_DMA_ME_CHSR_WRPD_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHSR_Bits.WRPD */
#define IFX_DMA_ME_CHSR_WRPD_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHSR_Bits.WRPD */
#define IFX_DMA_ME_CHSR_WRPD_OFF (17u)

/** \brief Length for Ifx_DMA_ME_CHSR_Bits.ICH */
#define IFX_DMA_ME_CHSR_ICH_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHSR_Bits.ICH */
#define IFX_DMA_ME_CHSR_ICH_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHSR_Bits.ICH */
#define IFX_DMA_ME_CHSR_ICH_OFF (18u)

/** \brief Length for Ifx_DMA_ME_CHSR_Bits.IPM */
#define IFX_DMA_ME_CHSR_IPM_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHSR_Bits.IPM */
#define IFX_DMA_ME_CHSR_IPM_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHSR_Bits.IPM */
#define IFX_DMA_ME_CHSR_IPM_OFF (19u)

/** \brief Length for Ifx_DMA_ME_CHSR_Bits.BUFFER */
#define IFX_DMA_ME_CHSR_BUFFER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHSR_Bits.BUFFER */
#define IFX_DMA_ME_CHSR_BUFFER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CHSR_Bits.BUFFER */
#define IFX_DMA_ME_CHSR_BUFFER_OFF (22u)

/** \brief Length for Ifx_DMA_ME_CHSR_Bits.FROZEN */
#define IFX_DMA_ME_CHSR_FROZEN_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CHSR_Bits.FROZEN */
#define IFX_DMA_ME_CHSR_FROZEN_MSK (0x1u)

